In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
myList=list("abcdef")
myList
label=list("uvwxyz")
label

['u', 'v', 'w', 'x', 'y', 'z']

In [6]:
f_series=pd.Series(data= myList,index=label)
f_series

u    a
v    b
w    c
x    d
y    e
z    f
dtype: object

In [7]:
np_con=np.array(["I","USA","JApan","Pak"])
np_con

array(['I', 'USA', 'JApan', 'Pak'], dtype='<U5')

In [8]:
cseries=pd.Series(np_con)
cseries

0        I
1      USA
2    JApan
3      Pak
dtype: object

In [9]:
fruits={"apple":100,"banana":50,"kiwi":45,"mango":20}
fruits

{'apple': 100, 'banana': 50, 'kiwi': 45, 'mango': 20}

In [10]:
fruits_series=pd.Series(fruits)  #shift double tab for knowing descrption of function
fruits_series

apple     100
banana     50
kiwi       45
mango      20
dtype: int64

In [11]:
fruits_series['mango']

20

In [12]:
scalars=pd.Series(5,index=['a','b','c'])
scalars

a    5
b    5
c    5
dtype: int64

In [13]:
fruits_series[1:4]

banana    50
kiwi      45
mango     20
dtype: int64

In [14]:
fruits_series.loc["apple"]

100

In [15]:
fruits_series.iloc[1]

50

In [16]:
vector_series=pd.Series([1,2,3,4],['a','b','c','d'])
vector_series1=pd.Series([10,20,30,40],['a','b','c','d'])
vector_series
vector_series1

a    10
b    20
c    30
d    40
dtype: int64

In [17]:
print(vector_series)

a    1
b    2
c    3
d    4
dtype: int64

In [18]:
print(vector_series+vector_series1)

a    11
b    22
c    33
d    44
dtype: int64

In [19]:
vector_series1=pd.Series([10,20,30,40],['a','d','e','f'])

In [20]:
sum_series=vector_series+vector_series1

In [21]:
olympic_data_list = {'HostCity':['London','Beijing','Athens','Sydney','Atlanta'],
                    'Year':[2012,2008,2004,2000,1996],
                    'No. Of Participating Countries':[205,204,201,200,197]
                    }

In [22]:
olympic_data_list

{'HostCity': ['London', 'Beijing', 'Athens', 'Sydney', 'Atlanta'],
 'Year': [2012, 2008, 2004, 2000, 1996],
 'No. Of Participating Countries': [205, 204, 201, 200, 197]}

In [23]:
olympic_df=pd.DataFrame(olympic_data_list)

In [24]:
olympic_df

  HostCity  Year  No. Of Participating Countries
0   London  2012                             205
1  Beijing  2008                             204
2   Athens  2004                             201
3   Sydney  2000                             200
4  Atlanta  1996                             197

In [25]:
olympic_df['HostCity']

0     London
1    Beijing
2     Athens
3     Sydney
4    Atlanta
Name: HostCity, dtype: object

In [30]:
olympic_df[['Year','HostCity']]

   Year HostCity
0  2012   London
1  2008  Beijing
2  2004   Athens
3  2000   Sydney
4  1996  Atlanta

In [31]:
olympic_df.describe()

              Year  No. Of Participating Countries
count     5.000000                        5.000000
mean   2004.000000                      201.400000
std       6.324555                        3.209361
min    1996.000000                      197.000000
25%    2000.000000                      200.000000
50%    2004.000000                      201.000000
75%    2008.000000                      204.000000
max    2012.000000                      205.000000

In [32]:
olympic_df.head(2)

  HostCity  Year  No. Of Participating Countries
0   London  2012                             205
1  Beijing  2008                             204

In [33]:
olympic_df.tail(2)

  HostCity  Year  No. Of Participating Countries
3   Sydney  2000                             200
4  Atlanta  1996                             197

In [34]:
olympic_df.columns

Index(['HostCity', 'Year', 'No. Of Participating Countries'], dtype='object')

In [35]:
olympic_df.dtypes

HostCity                          object
Year                               int64
No. Of Participating Countries     int64
dtype: object

In [36]:
olympic_df.shape

(5, 3)

In [37]:
sum_series

a    11.0
b     NaN
c     NaN
d    24.0
e     NaN
f     NaN
dtype: float64

In [38]:
drop_series=sum_series.dropna()

In [39]:
drop_series

a    11.0
d    24.0
dtype: float64

In [40]:
df_movie = pd.DataFrame({'movie 1': [5,4,3,5,1],'movie 2':[4,5,3,2,5]},index =['Tom','Jeff','Peter','Ram','Paul'])

In [41]:
df_movie

       movie 1  movie 2
Tom          5        4
Jeff         4        5
Peter        3        3
Ram          5        2
Paul         1        5

In [42]:
def mv_grade(rating):
 if rating==5:
    return 'A'
 if rating==4:
    return 'B'
 if rating==3:
    return 'C'
 else :
    return 'not great'

In [43]:
mv_grade(5)

'A'

In [44]:
df_movie.applymap(mv_grade)

         movie 1    movie 2
Tom            A          B
Jeff           B          A
Peter          C          C
Ram            A  not great
Paul   not great          A

In [45]:
df_movie.max()

movie 1    5
movie 2    5
dtype: int64

In [46]:
df_movie.min()

movie 1    1
movie 2    2
dtype: int64

In [47]:
df_movie.std()

movie 1    1.67332
movie 2    1.30384
dtype: float64

In [48]:
df_movie['movie 1'].max()

5

In [49]:
df_movie.to_csv('mv_rating.csv',index=False)

In [50]:
df_movie.to_excel('mv.xlsx',index=True)

In [52]:
labels = ['w','x','y','z']
list = [10,20,30,40]
array = np.array([10,20,30,40])
dict = {'w':10,'x':20,'y':30,'z':40}

In [53]:
pd.Series(data=list,index=labels)

w    10
x    20
y    30
z    40
dtype: int64

In [54]:
pd.Series(list,labels)

w    10
x    20
y    30
z    40
dtype: int64

In [55]:
pd.Series(dict)

w    10
x    20
y    30
z    40
dtype: int64

In [56]:
pd.Series(array,labels)

w    10
x    20
y    30
z    40
dtype: int32

In [57]:
sports1 = pd.Series([1,2,3,4],index = ['Cricket', 'Football','Basketball', 'Golf'])

In [58]:
sports1

Cricket       1
Football      2
Basketball    3
Golf          4
dtype: int64

In [59]:
sports2 = pd.Series([1,2,5,4],index = ['Cricket', 'Football','Baseball', 'Golf'])

In [60]:
sports2

Cricket     1
Football    2
Baseball    5
Golf        4
dtype: int64

In [61]:
sports1['Cricket']

1

In [62]:
sports1+sports2

Baseball      NaN
Basketball    NaN
Cricket       2.0
Football      4.0
Golf          8.0
dtype: float64

In [63]:
dataframe = pd.DataFrame(np.random.randn(10,5),index='A B C D E F G H I J'.split(),
                         columns='Score1 Score2 Score3 Score4 Score5'.split())

In [64]:
dataframe

     Score1    Score2    Score3    Score4    Score5
A -0.315478 -1.759865 -0.952090 -0.536590 -0.869778
B -1.168397  0.523982  0.476201 -0.132555 -0.828607
C -1.985793  0.226939 -1.100191  0.330939 -0.848736
D -1.206744  1.027275 -0.936293  1.195377  0.030836
E  0.946573 -0.928702 -0.143438 -1.421909  0.442936
F  0.117616 -0.177002 -0.230063 -0.025530 -0.234706
G -0.862739  1.032263 -0.350050 -0.990715 -0.003042
H  0.400880  0.201796  2.170008 -0.475921  0.033085
I  0.709512 -1.188519  1.155677  1.813644 -0.772438
J -0.994388 -1.033794  0.918903  0.145664 -0.081853

In [65]:
dataframe['Score3']

A   -0.952090
B    0.476201
C   -1.100191
D   -0.936293
E   -0.143438
F   -0.230063
G   -0.350050
H    2.170008
I    1.155677
J    0.918903
Name: Score3, dtype: float64

In [66]:
dataframe[['Score3','Score1']]

     Score3    Score1
A -0.952090 -0.315478
B  0.476201 -1.168397
C -1.100191 -1.985793
D -0.936293 -1.206744
E -0.143438  0.946573
F -0.230063  0.117616
G -0.350050 -0.862739
H  2.170008  0.400880
I  1.155677  0.709512
J  0.918903 -0.994388

In [67]:
type(dataframe['Score3'])

pandas.core.series.Series

In [68]:
type(dataframe[['Score3','Score1']])

pandas.core.frame.DataFrame

In [69]:
dataframe['Score6'] = dataframe['Score1'] + dataframe['Score2']

In [70]:
dataframe

     Score1    Score2    Score3    Score4    Score5    Score6
A -0.315478 -1.759865 -0.952090 -0.536590 -0.869778 -2.075343
B -1.168397  0.523982  0.476201 -0.132555 -0.828607 -0.644416
C -1.985793  0.226939 -1.100191  0.330939 -0.848736 -1.758854
D -1.206744  1.027275 -0.936293  1.195377  0.030836 -0.179469
E  0.946573 -0.928702 -0.143438 -1.421909  0.442936  0.017871
F  0.117616 -0.177002 -0.230063 -0.025530 -0.234706 -0.059386
G -0.862739  1.032263 -0.350050 -0.990715 -0.003042  0.169525
H  0.400880  0.201796  2.170008 -0.475921  0.033085  0.602676
I  0.709512 -1.188519  1.155677  1.813644 -0.772438 -0.479007
J -0.994388 -1.033794  0.918903  0.145664 -0.081853 -2.028182

In [71]:
dataframe=dataframe.drop('Score5',axis=1)

In [72]:
dataframe

     Score1    Score2    Score3    Score4    Score6
A -0.315478 -1.759865 -0.952090 -0.536590 -2.075343
B -1.168397  0.523982  0.476201 -0.132555 -0.644416
C -1.985793  0.226939 -1.100191  0.330939 -1.758854
D -1.206744  1.027275 -0.936293  1.195377 -0.179469
E  0.946573 -0.928702 -0.143438 -1.421909  0.017871
F  0.117616 -0.177002 -0.230063 -0.025530 -0.059386
G -0.862739  1.032263 -0.350050 -0.990715  0.169525
H  0.400880  0.201796  2.170008 -0.475921  0.602676
I  0.709512 -1.188519  1.155677  1.813644 -0.479007
J -0.994388 -1.033794  0.918903  0.145664 -2.028182

In [73]:
dataframe.drop('A',axis=0)

     Score1    Score2    Score3    Score4    Score6
B -1.168397  0.523982  0.476201 -0.132555 -0.644416
C -1.985793  0.226939 -1.100191  0.330939 -1.758854
D -1.206744  1.027275 -0.936293  1.195377 -0.179469
E  0.946573 -0.928702 -0.143438 -1.421909  0.017871
F  0.117616 -0.177002 -0.230063 -0.025530 -0.059386
G -0.862739  1.032263 -0.350050 -0.990715  0.169525
H  0.400880  0.201796  2.170008 -0.475921  0.602676
I  0.709512 -1.188519  1.155677  1.813644 -0.479007
J -0.994388 -1.033794  0.918903  0.145664 -2.028182

In [74]:
dataframe.loc['A']

Score1   -0.315478
Score2   -1.759865
Score3   -0.952090
Score4   -0.536590
Score6   -2.075343
Name: A, dtype: float64

In [75]:
dataframe.iloc[2]

Score1   -1.985793
Score2    0.226939
Score3   -1.100191
Score4    0.330939
Score6   -1.758854
Name: C, dtype: float64

In [76]:
dataframe.loc[['A','B'],['Score1','Score2']]

     Score1    Score2
A -0.315478 -1.759865
B -1.168397  0.523982

In [77]:
dataframe[dataframe>0.5]

     Score1    Score2    Score3    Score4    Score6
A       NaN       NaN       NaN       NaN       NaN
B       NaN  0.523982       NaN       NaN       NaN
C       NaN       NaN       NaN       NaN       NaN
D       NaN  1.027275       NaN  1.195377       NaN
E  0.946573       NaN       NaN       NaN       NaN
F       NaN       NaN       NaN       NaN       NaN
G       NaN  1.032263       NaN       NaN       NaN
H       NaN       NaN  2.170008       NaN  0.602676
I  0.709512       NaN  1.155677  1.813644       NaN
J       NaN       NaN  0.918903       NaN       NaN

In [78]:
dataframe[(dataframe['Score1']>0.5) & (dataframe['Score2'] < 0)]

     Score1    Score2    Score3    Score4    Score6
E  0.946573 -0.928702 -0.143438 -1.421909  0.017871
I  0.709512 -1.188519  1.155677  1.813644 -0.479007

In [79]:
dataframe = pd.DataFrame({'Cricket':[1,2,np.nan,4,6,7,2,np.nan],
                  'Baseball':[5,np.nan,np.nan,5,7,2,4,5],
                  'Tennis':[1,2,3,4,5,6,7,8]})

In [80]:
dataframe

   Cricket  Baseball  Tennis
0      1.0       5.0       1
1      2.0       NaN       2
2      NaN       NaN       3
3      4.0       5.0       4
4      6.0       7.0       5
5      7.0       2.0       6
6      2.0       4.0       7
7      NaN       5.0       8

In [81]:
dataframe.dropna()

   Cricket  Baseball  Tennis
0      1.0       5.0       1
3      4.0       5.0       4
4      6.0       7.0       5
5      7.0       2.0       6
6      2.0       4.0       7

In [82]:
dataframe.fillna(0)

   Cricket  Baseball  Tennis
0      1.0       5.0       1
1      2.0       0.0       2
2      0.0       0.0       3
3      4.0       5.0       4
4      6.0       7.0       5
5      7.0       2.0       6
6      2.0       4.0       7
7      0.0       5.0       8

In [83]:
dataframe.dropna(axis=1)

   Tennis
0       1
1       2
2       3
3       4
4       5
5       6
6       7
7       8

In [84]:
dataframe.dropna(thresh=2)

   Cricket  Baseball  Tennis
0      1.0       5.0       1
1      2.0       NaN       2
3      4.0       5.0       4
4      6.0       7.0       5
5      7.0       2.0       6
6      2.0       4.0       7
7      NaN       5.0       8

In [85]:
dataframe.fillna(0)

   Cricket  Baseball  Tennis
0      1.0       5.0       1
1      2.0       0.0       2
2      0.0       0.0       3
3      4.0       5.0       4
4      6.0       7.0       5
5      7.0       2.0       6
6      2.0       4.0       7
7      0.0       5.0       8

In [86]:
dataframe['Baseball'].fillna(value=dataframe['Baseball'].mean())

0    5.000000
1    4.666667
2    4.666667
3    5.000000
4    7.000000
5    2.000000
6    4.000000
7    5.000000
Name: Baseball, dtype: float64

In [87]:
# Create dataframe as given below
dat = {'CustID':['1001','1001','1002','1002','1003','1003'],
       'CustName':['UIPat','DatRob','Goog','Chrysler','Ford','GM'],
       'Profitinlakhs':[2005,3245,1245,8765,5463,3547]}

In [88]:
dataframe = pd.DataFrame(dat)

In [89]:
dataframe

  CustID  CustName  Profitinlakhs
0   1001     UIPat           2005
1   1001    DatRob           3245
2   1002      Goog           1245
3   1002  Chrysler           8765
4   1003      Ford           5463
5   1003        GM           3547

In [90]:
CustID_grouped = dataframe.groupby('CustID')

In [91]:
CustID_grouped

In [92]:
CustID_grouped.describe().transpose()

CustID                      1001         1002         1003
Profitinlakhs count     2.000000     2.000000     2.000000
              mean   2625.000000  5005.000000  4505.000000
              std     876.812409  5317.442995  1354.816593
              min    2005.000000  1245.000000  3547.000000
              25%    2315.000000  3125.000000  4026.000000
              50%    2625.000000  5005.000000  4505.000000
              75%    2935.000000  6885.000000  4984.000000
              max    3245.000000  8765.000000  5463.000000

In [93]:
dataframe.groupby('CustID').mean()

        Profitinlakhs
CustID
1001             2625
1002             5005
1003             4505

In [94]:
dataframe = pd.DataFrame({'custID':[1,2,3,4],'SaleType':['big','small','medium','big'],'SalesCode':['121','131','141','151']})
dataframe

   custID SaleType SalesCode
0       1      big       121
1       2    small       131
2       3   medium       141
3       4      big       151

In [95]:
dataframe['SaleType'].nunique()

3

In [96]:
dataframe['SaleType'].value_counts()

big       2
medium    1
small     1
Name: SaleType, dtype: int64

In [97]:
#Select from DataFrame using criteria from multiple columns
newdataframe = dataframe[(dataframe['custID']!=3) & (dataframe['SaleType']=='big')]

In [98]:
newdataframe

   custID SaleType SalesCode
0       1      big       121
3       4      big       151

In [99]:
dataframe['custID'].sum()

10

In [100]:
del dataframe['custID']

In [101]:
dataframe

  SaleType SalesCode
0      big       121
1    small       131
2   medium       141
3      big       151

In [102]:
dataframe.index

RangeIndex(start=0, stop=4, step=1)

In [103]:
dataframe.columns

Index(['SaleType', 'SalesCode'], dtype='object')

In [104]:
dataframe.sort_values(by='SaleType')

  SaleType SalesCode
0      big       121
3      big       151
2   medium       141
1    small       131

In [105]:
dataframe.isnull()

   SaleType  SalesCode
0     False      False
1     False      False
2     False      False
3     False      False

In [106]:
dataframe = pd.read_csv('mv_rating.csv')

In [107]:
dataframe

   movie 1  movie 2
0        5        4
1        4        5
2        3        3
3        5        2
4        1        5

In [108]:
dataframe.to_csv('train2.csv',index=False)